cfd/OpenFOAM/incompressible/simpleFoam/03_Force_Coefs_Half/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 0 1 -1 0 0 0 0 ];

internalField   uniform ($flowVelocity 0 0);


boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform ( 0 0 0 );
        value       $internalField;
    }

    freestream
    {
        type        slip;
    }
    
    model
    {
        type        noSlip;
    }

    sym
    {
        type        symmetryPlane;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
