cfd/OpenFOAM/incompressible/simpleFoam/03_Force_Coefs_Half/system/include/convergenceConditions
// convergence conditions
convergenceCondition_p      1e-2;
convergenceCondition_U      1e-3;
convergenceCondition_k      1e-3;
convergenceCondition_omega  1e-4;
