cfd/OpenFOAM/incompressible/simpleFoam/03_Force_Coefs_Half/system/include/materialPoint
// material point coordinates
materialPoint_x 1.0000001;
materialPoint_y 1.0000001;
materialPoint_z 1.0000001;
