cfd/OpenFOAM/incompressible/simpleFoam/03_Force_Coefs_Half/system/include/referenceData
// reference data for force coefficient computations
referenceLength     0.64607;
referenceArea       0.7532;
